Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/birth_family_relationships/cohabiting_couples/fertility_services_and_unmarried_couples.html.txt.tmx
Source language: en
Languages: ga

source: Fertility services and cohabiting couples
ga: Seirbhísí torthúlachta agus lánúineacha comhchónaithe

source: There are a number of different types of fertility services available, including artificial insemination and in vitro fertilisation
ga: Tá roinnt cinéalácha difríúla seirbhísí torthúlachta ar fáil, ina measc inseamhnú saorga agus toirchiú in-vitreach

source: Part 3 of the Children and Family Relationships Act 2015 legislates for donor-assisted human reproduction, but has not yet been commenced
ga: Cuid 3 d'Acht na Leanaí agus Caidrimh Theaghlaigh 2015 reachtaíocht don atáirgeadh daonna deontóir-cúnamh, ach nár cuireadh tús go fóill

source: Medical practice concerning the provision of Assisted Human Reproduction Services is governed by guidelines issued by the Irish Medical Council (pdf)
ga: Tá an cleachtas míochaine maidir le Seirbhísí Atáirgthe Dhaonna Chuidithe á rialú ag treoirlínte eisithe ag Comhairle na nDochtúirí Leighis (pdf)

source: Fertility services are generally available to applicants who are in a "stable relationship"
ga: Tá seirbhísí torthúlachta ar fáil go ginearálta do iarrathóirí atá i "ngaol seasmhach"

source: This is understood to mean married and cohabiting opposite-sex couples
ga: Glactar go gciallaíonn sé seo lánúineacha heitrighnéasacha atá pósta agus nach bhfuil pósta

source: Clinics generally refuse to make assisted reproduction available to cohabiting same-sex couples
ga: I gcleachtas, is gnách go ndiúltaíonn clinicí chun síolrú cuidithe a chur ar fáil do lánúineacha comhchónaithe comhghnéis

source: It has not yet been decided by an Irish court whether this refusal amounts to discrimination on the grounds of sexual orientation under the Equal Status Act 2000 or the Equality Act 2004
ga: Ní dhearna cúirt in Éirinn an cinneadh go fóill arb ionann an diúltú seo agus leithcheal ar bhonn claonadh gnéis faoin Acht um Stádas Comhionann, 2000 nó faoin Acht Comhionannais, 2004
